ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/FSS_FSS_FSAS_GENREGS_53801000h.xml
<module name="FSS_FSAS_GENREGS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="FSS_FSAS_GENREGS_REVISION" acronym="FSS_FSAS_GENREGS_REVISION" offset="0" width="32" description="IP Revision Identifier (X.Y.R) Used by software to track features, bugs, and compatibility.">
		<bitfield id="MODID" width="16" begin="31" end="16" resetval="0x26704" description="Module ID field" range="31:16" rwaccess="R"/>
	<bitfield id="REVRTL" width="5" begin="15" end="11" resetval="0x4" description="RTL revision. Will vary depending on release." range="15:11" rwaccess="R"/>
	<bitfield id="REVMAJ" width="3" begin="10" end="8" resetval="0x2" description="Major revision" range="10:8" rwaccess="R"/>
	<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom" range="7:6" rwaccess="R"/>
	<bitfield id="REVMIN" width="6" begin="5" end="0" resetval="0x0" description="Minor revision" range="5:0" rwaccess="R"/>
	</register><register id="FSS_FSAS_GENREGS_SYSCONFIG" acronym="FSS_FSAS_GENREGS_SYSCONFIG" offset="4" width="32" description="Controls various parameters of the cotroller state.">
		<bitfield id="HW_RW_DELAY_COUNT" width="8" begin="18" end="11" resetval="0x10" description="Delay for switching between reads and writes" range="18:11" rwaccess="R/W"/>
	<bitfield id="HW_RW_DELAY_EN" width="1" begin="10" end="10" resetval="0x0" description="Enable delay when switching between reads and writes to avoid read-write collision for sensitive logic." range="10" rwaccess="R/W"/>
	<bitfield id="DP_EN" width="1" begin="9" end="9" resetval="0x0" description=" 0 Safety double pumping disabled. 1 Safety double pumping enabled" range="9" rwaccess="R/W"/>
	<bitfield id="OSPI_32B_DISABLE_MODE" width="1" begin="8" end="8" resetval="0x0" description=" 0 OSPI 32bit mode enabled. 1 OSPI 32bit mode disabled" range="8" rwaccess="R/W"/>
	<bitfield id="DISXIP" width="1" begin="7" end="7" resetval="0x0" description=" This field is used to disable XIP prefetching. 0 XIP Prefetch Enabled. 1 XIP prefetch disabled Please note that this is referring to prefetching feature that is useful for linear accesses associated with XIP. This is NOT referring to XIP features implemented in flash Controller or memory device." range="7" rwaccess="R/W"/>
	<bitfield id="OSPI_DDR_DISABLE_MODE" width="1" begin="6" end="6" resetval="0x0" description=" 0 OSPI DDR mode enabled. 1 OSPI DDR mode disabled" range="6" rwaccess="R/W"/>
	<bitfield id="ECC_DISABLE_ADR" width="1" begin="3" end="3" resetval="0x0" description=" 0 Block address within ECC calculation, 1 Block address not within ECC calculation" range="3" rwaccess="R/W"/>
	<bitfield id="FSS_AES_EN_IPCFG" width="1" begin="2" end="2" resetval="0x0" description=" 1 select security, 0 disable security" range="2" rwaccess="R"/>
	<bitfield id="ECC_EN" width="1" begin="0" end="0" resetval="0x0" description=" 0 ECC disabled. 1 ECC enabled" range="0" rwaccess="R/W"/>
	</register><register id="FSS_FSAS_GENREGS_DP_ERR_INJ_CTRL" acronym="FSS_FSAS_GENREGS_DP_ERR_INJ_CTRL" offset="128" width="32" description="This register is used to setup double pumping error injection. Only one error injection enable field has to be set in this register at a given time. After error injection is enabled, a read must be issued to a valid flash address in order to trigger the error. Once triggered, the error will be reported using IRQ.STATUS register dp_cmd_err/dp_ret_err fields and corresponding interrupt fsas_ecc_intr_err_pend/fsas_ecc_intr_err_req will be generated if enabled.">
		<bitfield id="BIT_SEL" width="8" begin="15" end="8" resetval="0x0" description="Bit select for injecting error on command or read return fields. For command error, only 0 through 47 are valid values for bit select. For read return error, only 0 through 166 are valid values for bit select." range="15:8" rwaccess="R/W"/>
	<bitfield id="RET_NFIRST_LAST" width="1" begin="4" end="4" resetval="0x0" description="1'b0 - Inject on first read return phase, 1'b1 - Inject on last read return phase" range="4" rwaccess="R/W"/>
	<bitfield id="EN_DUPL_RET" width="1" begin="3" end="3" resetval="0x0" description="Enable error injection on duplicate read return fields." range="3" rwaccess="R/W"/>
	<bitfield id="EN_ORIG_RET" width="1" begin="2" end="2" resetval="0x0" description="Enable error injection on original read return fields." range="2" rwaccess="R/W"/>
	<bitfield id="EN_DUPL_CMD" width="1" begin="1" end="1" resetval="0x0" description="Enable error injection on duplicate command fields." range="1" rwaccess="R/W"/>
	<bitfield id="EN_ORIG_CMD" width="1" begin="0" end="0" resetval="0x0" description="Enable error injection on original command fields." range="0" rwaccess="R/W"/>
	</register><register id="FSS_FSAS_GENREGS_IRQ_IRQ_EOI" acronym="FSS_FSAS_GENREGS_IRQ_IRQ_EOI" offset="16" width="32" description="The End of Interrupt (EOI) Register allows the CPU to acknowledge completion of fsas_ecc_intr_err_req pulse interrupt. When this register is written to 1'b0, INTD logic used for converting fsas_ecc_intr_err_pend level interrupt to pulse will be re-armed. That is, if interrupt sources remain after writing this register to 1'b0, another pulse interrupt will be triggered by INTD.  Conversely, if this register is not written to 1'b0 after fsas_ecc_intr_err_req pulse interrupt is received, then another pulse interrupt will not be received as INTD has not been re-armed. This register will be reset one cycle after it has been written to. Please note that the reason for writing 1'b0 is because there is only one interrupt (no interrupt aggregation) associated with this EOI and the INTD vector associated with this interrupt is 1'b0.">
		<bitfield id="EOI_VECTOR" width="1" begin="0" end="0" resetval="0x0" description="Write 1'b0 to acknowledge fsas_ecc_intr_err_req pulse interrupt." range="0" rwaccess="W"/>
	</register><register id="FSS_FSAS_GENREGS_IRQ_IRQ_STATUS_RAW" acronym="FSS_FSAS_GENREGS_IRQ_IRQ_STATUS_RAW" offset="20" width="32" description="The IRQ_STATUS_RAW register allows the interrupt sources associated with each bit in this register to be manually set when writing a 1 to a specific bit. This register corresponds to fsas_ecc_intr_err_pend (level) and fsas_ecc_intr_err_req (pulse) interrupt outputs. Write 0: No action Write 1: Set event Read 0: No event pending Read 1: Event pending">
		<bitfield id="DP_RET_ERROR" width="1" begin="4" end="4" resetval="0x0" description="Safety double pumping read return error" range="4" rwaccess="R/W1TS"/>
	<bitfield id="DP_CMD_ERROR" width="1" begin="3" end="3" resetval="0x0" description="Safety double pumping command error" range="3" rwaccess="R/W1TS"/>
	<bitfield id="ECC_WRITE_NONALIGN" width="1" begin="2" end="2" resetval="0x0" description="Write is not aligned to 32B boundary or not a multiple of 32B" range="2" rwaccess="R/W1TS"/>
	<bitfield id="ECC_ERROR_2BIT" width="1" begin="1" end="1" resetval="0x0" description="An ECC error occurred on 2 bits and was not correctable" range="1" rwaccess="R/W1TS"/>
	<bitfield id="ECC_ERROR_1BIT" width="1" begin="0" end="0" resetval="0x0" description="An ECC error occurred on only 1 bit and was corrected" range="0" rwaccess="R/W1TS"/>
	</register><register id="FSS_FSAS_GENREGS_IRQ_IRQ_STATUS" acronym="FSS_FSAS_GENREGS_IRQ_IRQ_STATUS" offset="24" width="32" description="The IRQ_STATUS register allows the interrupt sources associated with each bit in this register to be manually cleared when writing a 1 to a specific bit. This register corresponds to fsas_ecc_intr_err_pend (level) and fsas_ecc_intr_err_req (pulse) interrupt outputs.  Write 0: No action Write 1: Clear event Read 0: No event pending Read 1: Event pending">
		<bitfield id="DP_RET_ERROR" width="1" begin="4" end="4" resetval="0x0" description="Safety double pumping read return error" range="4" rwaccess="R/W1TC"/>
	<bitfield id="DP_CMD_ERROR" width="1" begin="3" end="3" resetval="0x0" description="Safety double pumping command error" range="3" rwaccess="R/W1TC"/>
	<bitfield id="ECC_WRITE_NONALIGN" width="1" begin="2" end="2" resetval="0x0" description="Write is not aligned to 32B boundary or not a multiple of 32B" range="2" rwaccess="R/W1TC"/>
	<bitfield id="ECC_ERROR_2BIT" width="1" begin="1" end="1" resetval="0x0" description="An ECC error on 2 bits. Not correctable" range="1" rwaccess="R/W1TC"/>
	<bitfield id="ECC_ERROR_1BIT" width="1" begin="0" end="0" resetval="0x0" description="ECC error on 1 bits. corrected" range="0" rwaccess="R/W1TC"/>
	</register><register id="FSS_FSAS_GENREGS_IRQ_IRQ_ENABLE_SET" acronym="FSS_FSAS_GENREGS_IRQ_IRQ_ENABLE_SET" offset="28" width="32" description="The IRQ_ENABLE_SET register allows the interrupt sources associated with each bit in this register to be manually enabled when writing a 1 to a specific bit.  This register corresponds to fsas_ecc_intr_err_pend (level) and fsas_ecc_intr_err_req (pulse) interrupt outputs. Write 0: No action Write 1: Enable event Read 0: Event is disabled Read 1: Event is enabled">
		<bitfield id="DP_RET_ERROR" width="1" begin="4" end="4" resetval="0x0" description="Safety double pumping read return error" range="4" rwaccess="R/W1TS"/>
	<bitfield id="DP_CMD_ERROR" width="1" begin="3" end="3" resetval="0x0" description="Safety double pumping command error" range="3" rwaccess="R/W1TS"/>
	<bitfield id="ECC_WRITE_NONALIGN" width="1" begin="2" end="2" resetval="0x0" description="Write is not aligned to 32B boundary or not a multiple of 32B" range="2" rwaccess="R/W1TS"/>
	<bitfield id="ECC_ERROR_2BIT" width="1" begin="1" end="1" resetval="0x0" description="ECC error on 2 bits. Not correctable" range="1" rwaccess="R/W1TS"/>
	<bitfield id="ECC_ERROR_1BIT" width="1" begin="0" end="0" resetval="0x0" description="ECC error on 1 bits. corrected" range="0" rwaccess="R/W1TS"/>
	</register><register id="FSS_FSAS_GENREGS_IRQ_IRQ_ENABLE_CLR" acronym="FSS_FSAS_GENREGS_IRQ_IRQ_ENABLE_CLR" offset="32" width="32" description="The IRQ_ENABLE_CLR register allows the interrupt sources associated with each bit in this register to be manually disabled when writing a 1 to a specific bit.  This register corresponds to fsas_ecc_intr_err_pend (level) and fsas_ecc_intr_err_req (pulse) interrupt outputs. Write 0: No action Write 1: Disable event Read 0: Event is disabled Read 1: Event is enabled">
		<bitfield id="DP_RET_ERROR" width="1" begin="4" end="4" resetval="0x0" description="Safety double pumping read return error" range="4" rwaccess="R/W1TC"/>
	<bitfield id="DP_CMD_ERROR" width="1" begin="3" end="3" resetval="0x0" description="Safety double pumping command error" range="3" rwaccess="R/W1TC"/>
	<bitfield id="ECC_WRITE_NONALIGN" width="1" begin="2" end="2" resetval="0x0" description="Write is not aligned to 32B boundary or not a multiple of 32B" range="2" rwaccess="R/W1TC"/>
	<bitfield id="ECC_ERROR_2BIT" width="1" begin="1" end="1" resetval="0x0" description="ECC error on 2 bits. Not correctable" range="1" rwaccess="R/W1TC"/>
	<bitfield id="ECC_ERROR_1BIT" width="1" begin="0" end="0" resetval="0x0" description="ECC error on 1 bits. corrected" range="0" rwaccess="R/W1TC"/>
	</register><register id="FSS_FSAS_GENREGS_ECC_REGCTRL_ECC_RGSTRT_j" acronym="FSS_FSAS_GENREGS_ECC_REGCTRL_ECC_RGSTRT_j" offset="48" width="32" description="This defines the start of the ECC region in 4KBytes steps.">
		<bitfield id="R_START" width="20" begin="19" end="0" resetval="0x0" description="This defines the start of the ECC region in 4KBytes steps.  Address start = {start[19:0], 0x000} 0x0 means the start is 0x0000_0000  0x1 means the start is 0x0000_1000 0xA means the start is 0x0000_A000 Note the offset + size should be &#60;= 4GBytes, wrap around is not supported." range="19:0" rwaccess="R/W"/>
	</register><register id="FSS_FSAS_GENREGS_ECC_REGCTRL_ECC_RGSIZ_j" acronym="FSS_FSAS_GENREGS_ECC_REGCTRL_ECC_RGSIZ_j" offset="52" width="32" description="This defines the size of the ECC region in 4KBytes steps.">
		<bitfield id="R_SIZE" width="20" begin="19" end="0" resetval="0x0" description="This defines the size of the ECC region in 4KBytes steps 0x0 means the size is zero and disabled  0x1 means the size is 4KBytes 0xA means the size is 40KBytes 0xF_FFFF means the size is 4GBytes Note the offset + size should be &#60;= 4GBytes, wrap around is not supported." range="19:0" rwaccess="R/W"/>
	</register><register id="FSS_FSAS_GENREGS_ERR_ECC_BLOCK_ADR" acronym="FSS_FSAS_GENREGS_ERR_ECC_BLOCK_ADR" offset="112" width="32" description="The ERR_ECC_BLOCK_ADR register holds the current top of stack ECC error block address, this is only valid when the ecc_err_valid is set">
		<bitfield id="ECC_ERROR_BLOCK_ADDR" width="27" begin="31" end="5" resetval="0x0" description="ECC 32 byte aligned block address" range="31:5" rwaccess="R"/>
	</register><register id="FSS_FSAS_GENREGS_ERR_ECC_TYPE" acronym="FSS_FSAS_GENREGS_ERR_ECC_TYPE" offset="116" width="32" description="The ERR_ECC_TYPE register holds the current top of stack ECC error info, this is only valid when the ecc_err_valid is set">
		<bitfield id="ECC_ERR_VALID" width="1" begin="31" end="31" resetval="0x0" description="When set indicates that there is valid ECC error information available, Writing a one to this register will pop the top of the stack" range="31" rwaccess="R/W1TC"/>
	<bitfield id="ECC_ERR_ADR" width="1" begin="5" end="5" resetval="0x0" description="When set indicates that there was a single error detected within the address field. Bits 0 and 1 in this register indicate whether it is single or double error." range="5" rwaccess="R"/>
	<bitfield id="ECC_ERR_MAC" width="1" begin="4" end="4" resetval="0x0" description="When set indicates that there was a single error detected within the MAC field. Bits 0 and 1 in this register indicate whether it is single or double error." range="4" rwaccess="R"/>
	<bitfield id="ECC_ERR_DA1" width="1" begin="3" end="3" resetval="0x0" description="When set indicates that there was a single error detected within the High Data word, which is bits 127 through 64 of the data word. Bits 0 and 1 in this register indicate whether it is single or double error." range="3" rwaccess="R"/>
	<bitfield id="ECC_ERR_DA0" width="1" begin="2" end="2" resetval="0x0" description="When set indicates that there was a single error detected within the Low Data word, which is bits 63 through 0 of the data word. Bits 0 and 1 in this register indicate whether it is single or double error." range="2" rwaccess="R"/>
	<bitfield id="ECC_ERR_DED" width="1" begin="1" end="1" resetval="0x0" description="When set indicates that there was a double error detected for the block" range="1" rwaccess="R"/>
	<bitfield id="ECC_ERR_SEC" width="1" begin="0" end="0" resetval="0x0" description="When set indicates that there was a single error detected for the block. The fields that had single error are reported by bits 2 through 5 in this register. It is possible that single error is reported in multiple fields since the ECCM inputs are partitioned into four partitions and ECC code is separate for each partition. It is also possible that none of the fields report single error even though ecc_err_sec bit is set. This can happen if single bit error occurred on the ECC code." range="0" rwaccess="R"/>
	</register><register id="FSS_FSAS_GENREGS_ERR_WRT_TYPE" acronym="FSS_FSAS_GENREGS_ERR_WRT_TYPE" offset="120" width="32" description="The ERR_WRT_TYPE register holds the current top of stack write error info. this is only valid when the wrt_err_valid is set">
		<bitfield id="WRT_ERR_VALID" width="1" begin="31" end="31" resetval="0x0" description="When set indicates that there is valid write error information available, Writing a one to this register will pop the top of the stack" range="31" rwaccess="R/W1TC"/>
	<bitfield id="WRT_ERR_BEN" width="1" begin="13" end="13" resetval="0x0" description="When set indicates that there was a write error due to a non-contiguous byte enables or because write byte count was not 32-byte multiple. Please note that this bit will always be set when wrt_err_valid bit is set. There is no write error if byte count is 32-byte multiple and if byte-enables are all set." range="13" rwaccess="R"/>
	<bitfield id="WRT_ERR_ADR" width="1" begin="12" end="12" resetval="0x0" description="When set indicates that there was a write error due to a non-aligned address. Please note that this bit can only be set if address was 16-byte multiple but not 32-byte multiple. For example, an address of 0x10 or 0x30 for writes will cause this bit to get set." range="12" rwaccess="R"/>
	<bitfield id="WRT_ERR_ROUTEID" width="12" begin="11" end="0" resetval="0x0" description="Indicates the Route ID for the Master that caused the write error" range="11:0" rwaccess="R"/>
	</register>
</module>